app/Controllers/admin/MetaController.php

    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }

        $data['meta'] = $this->metaModel->findAll();
---
SELECT *
FROM `tb_meta`