app/Controllers/user/Aboutctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'About'
 LIMIT 1
---
    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
        ];

        $data['Title'] = $data['profil'][0]->title_website;

        helper('text');

        if (session('lang') === 'in') {
            $teks = strip_tags($data['profil'][0]->deskripsi_perusahaan_in);
        } else {
            $teks = strip_tags($data['profil'][0]->deskripsi_perusahaan_en);
        }

        $meta = $this->MetaModel->where('nama_halaman', 'About')->first(); // Ambil meta untuk halaman Home