app/Controllers/user/Artikelctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Artikel'
 LIMIT 1
---
    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
        ];

        helper('text');

        // Set meta description based on session language
        $metaDescription = $this->generateMetaDescription($data);
        $data['Meta'] = character_limiter($metaDescription, 150);

        $meta = $this->MetaModel->where('nama_halaman', 'Artikel')->first(); // Ambil meta untuk halaman Home

SELECT *
FROM `tb_profil`
---
    public function detail($id_artikel)
    {
        $artikel = $this->ArtikelModel->getDetailArtikel($id_artikel);

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan ID $id_artikel tidak ditemukan");
        }

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($id_artikel, 4),
        ];