app/Controllers/user/Contactctrl.php

    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
        ];

        helper('text');

        if (session('lang') === 'in') {
            $nama_perusahaan = $data['profil'][0]->nama_perusahaan;
            $deskripsi_perusahaan = strip_tags($data['profil'][0]->deskripsi_perusahaan_in);

            $data['Title'] = $data['tbaktivitas']->nama_aktivitas_in ?? 'Kotak';
            $teks = "Contact of $nama_perusahaan. $deskripsi_perusahaan";
        } else {
            $nama_perusahaan = $data['profil'][0]->nama_perusahaan;
            $deskripsi_perusahaan = strip_tags($data['profil'][0]->deskripsi_perusahaan_en);

            $data['Title'] = $data['tbaktivitas']->nama_aktivitas_en ?? 'Contact';
            $teks = "Contact of $nama_perusahaan. $deskripsi_perusahaan";
        }

        $meta = $this->MetaModel->where('nama_halaman', 'Contact')->first(); // Ambil meta untuk halaman Home
---
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Contact'
 LIMIT 1