app/Controllers/user/Productsctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Product'
 LIMIT 1
---
    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
        ];

        helper('text');

        if (session('lang') === 'in') {
            $nama_perusahaan = $data['profil'][0]->nama_perusahaan;
            $deskripsi_perusahaan = strip_tags($data['profil'][0]->deskripsi_perusahaan_in);

            $data['Title'] = $data['tbproduk']->nama_produk_in ?? 'Produk';
            $teks = "Produk dari $nama_perusahaan. $deskripsi_perusahaan";
        } else {
            $nama_perusahaan = $data['profil'][0]->nama_perusahaan;
            $deskripsi_perusahaan = strip_tags($data['profil'][0]->deskripsi_perusahaan_en);

            $data['Title'] = $data['tbproduk']->nama_produk_en ?? 'Products';
            $teks = "Products of $nama_perusahaan. $deskripsi_perusahaan";
        }

        $meta = $this->MetaModel->where('nama_halaman', 'Product')->first(); // Ambil meta untuk halaman Home

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_produk`
WHERE `tb_produk`.`id_produk` = '3'
---
    public function detail($id_produk)
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbproduk' => $this->ProdukModel->find($id_produk),
        ];